In [2]:
import pandas as pd

task 1: load the data set and display its shape,col,and data types

In [3]:
import pandas as pd
df = pd.read_csv('task.csv')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [4]:
df.shape

(1000, 9)

In [5]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [6]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

task2: cal the percentage of misssing values for each col

In [7]:
df.isna().mean() * 100

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

task3: identify col contaning mixed data types

In [8]:
[col for col in df.columns if df[col].apply(type).nunique() > 1]

['user_id',
 'age',
 'salary',
 'department',
 'join_date',
 'city',
 'performance_score',
 'experience_years',
 'is_active']

In [9]:
#another method
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

task4: clean user id by replacing empty strings with NaN and converting values to upper case

In [10]:
df['user_id'].replace('',pd.NA).str.upper()

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: object

task 5: convert age to numeric and replace invalid values(negative 0r>100) with NaN

In [11]:

df['age'] = pd.to_numeric(df['age'], errors='coerce')
df.loc[(df['age'] < 0) | (df['age'] > 100), 'age'] = pd.NA
df['age']

0       NaN
1      30.0
2      30.0
3       NaN
4       NaN
       ...
995    60.0
996     NaN
997     NaN
998     NaN
999    30.0
Name: age, Length: 1000, dtype: float64

TASK 6: clean salary by removing currency symbols and converting it to numeric

In [12]:
#6. Clean salary by removing currency symbols and converting it to numeric
df['salary'] = df['salary'].replace('[\$,]', '', regex=True)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
df['salary']

0            NaN
1       45000.00
2       25000.00
3            NaN
4      120000.75
         ...
995          NaN
996          NaN
997     25000.00
998     25000.00
999     45000.00
Name: salary, Length: 1000, dtype: float64

task 7: convert join date into datetime format handiling multiple date formates

In [13]:
#7. Convert join_date to datetime format handling multiple date formats
df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce', dayfirst=True)
df['join_date']

0     2020-01-12
1            NaT
2            NaT
3            NaT
4            NaT
         ...
995          NaT
996          NaT
997          NaT
998          NaT
999          NaT
Name: join_date, Length: 1000, dtype: datetime64[ns]

task :8 extract joining year from the cleaned join date

In [14]:

#8.Extract Joining year from the cleaned join_date
df['joining_year'] = df['join_date'].dt.year
df['joining_year']

0      2020.0
1         NaN
2         NaN
3         NaN
4         NaN
        ...
995       NaN
996       NaN
997       NaN
998       NaN
999       NaN
Name: joining_year, Length: 1000, dtype: float64

task :9 standarize departement values by trimming spaces and convertye to upper caser

In [15]:
#9.Standardize department values by trimming spaces and converting to uppercase
df['department'] = (df['department'].str.strip().str.upper())
df['department']

0           HR
1      FINANCE
2           HR
3           HR
4           IT
        ...
995         HR
996         IT
997         HR
998        NaN
999         HR
Name: department, Length: 1000, dtype: object

task:10 Normalize city names to a consistent case and spelling

In [16]:
#10.Normalize city names to a consistent case and spelling
df['city']=df['city'].str.strip().str.title()
df['city']

0          Delhi
1          Delhi
2          Delhi
3      Hyderabad
4          Delhi
         ...
995        Delhi
996       Mumbai
997       Mumbai
998    Bangalore
999    Hyderabad
Name: city, Length: 1000, dtype: object

task:11 convert performance score into numeric by mapping text values to numbers

In [17]:
#11.Convert performance score into numeric by mapping text values to numbers
performance_mapping = {'Poor': 0,'Excellent':1}
df['performance_score'] = df['performance_score'].map(performance_mapping)
df['performance_score'] = pd.to_numeric(df['performance_score'],errors='coerce')
df['performance_score']

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
995   NaN
996   NaN
997   NaN
998   NaN
999   NaN
Name: performance_score, Length: 1000, dtype: float64

task 12: clean experience years by converting text values to numeric and removing negative

In [18]:
#12.Clean experience_years by converting text values to numeric and removing negatives
df['experience_years'] = pd.to_numeric(df['experience_years'], errors='coerce')
df.loc[df['experience_years'] < 0, 'experience_years'] = pd.NA
df['experience_years']

0       NaN
1       1.0
2      10.0
3       5.0
4       NaN
       ...
995     NaN
996     5.0
997     5.0
998     0.0
999     NaN
Name: experience_years, Length: 1000, dtype: float64

task 13 : convert is active values (yes/no/True/False) into boolean format

In [19]:
#13.Convert is_active values(True/False) into boolean format
df['is_active']=df['is_active'].replace({'yes':'True','no':'False'})
df['is_active'].astype('bool')
df['is_active']

0       True
1       True
2      False
3       True
4      False
       ...
995      NaN
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: object

task 14: identify and remove  dupilcates record based on user id

In [20]:
#14.Identify and remove duplicate records based on user_id
df = df.drop_duplicates(subset="user_id")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,user_0,NaN,NaN,HR,2020-01-12,Delhi,NaN,NaN,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,NaN,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,NaN,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,NaN,5.0,True,NaN
5,user_5,NaN,25000.0,IT,NaT,NaN,NaN,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,user_997,NaN,25000.0,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,NaN,0.0,True,NaN

task 15  create a clean final data frame contaning only valid standardized records

In [21]:
clean_df = df.dropna().drop_duplicates().reset_index(drop=True)

clean_df.info()
clean_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            0 non-null      object
 1   age                0 non-null      float64
 2   salary             0 non-null      float64
 3   department         0 non-null      object
 4   join_date          0 non-null      datetime64[ns]
 5   city               0 non-null      object
 6   performance_score  0 non-null      float64
 7   experience_years   0 non-null      float64
 8   is_active          0 non-null      object
 9   joining_year       0 non-null      float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 132.0+ bytes

Empty DataFrame
Columns: [user_id, age, salary, department, join_date, city, performance_score, experience_years, is_active, joining_year]
Index: []